In [25]:
import pandas as pd
import random

In [8]:
data =pd.read_csv("persons_sample.csv")
data.head()

   author first_name middle_name last_name  id_number         dob gender
0       1    ONYANGO      GEORGE    MARUGE   33098733  29/11/1993      M
1       1      KAMAU      GEORGE    KARIMI   28976539  31/12/1997      M
2       1      Owili       Helen    Obimbo    1712854  22/12/1999      M
3       1     Mugure      Hannah    Manjai    3042624  31/08/1972      M
4       1     Wahowa     Achando    Wahowa     864870  15/01/1997      M

In [9]:
def myrecode(x):
    len_id = len(str(x))
    sub = 8 - len_id
    id =""
    if sub>0:
        id= "0"*sub + str(x)
    else:
        id=str(x)
    return id

data["id_number"] = data["id_number"].apply(myrecode)
data.head()

   author first_name middle_name last_name id_number         dob gender
0       1    ONYANGO      GEORGE    MARUGE  33098733  29/11/1993      M
1       1      KAMAU      GEORGE    KARIMI  28976539  31/12/1997      M
2       1      Owili       Helen    Obimbo  01712854  22/12/1999      M
3       1     Mugure      Hannah    Manjai  03042624  31/08/1972      M
4       1     Wahowa     Achando    Wahowa  00864870  15/01/1997      M

In [156]:

def dob_id_format(dob,gender, id_num):
#     part=f"{dob},{gender},{id_num}"
    dob= str(dob)
    dob1= dob.split("/")
    year = dob1[2][-2:]
    month = dob1[1]
    day = dob1[0]
    dob= year + month + day
    fixed ="1702150"
    id_num ="B00"+id_num
    rand= random.randint(0, 9)
    gender = gender
    part = dob+str(rand)+gender+fixed + "<" + id_num +gender +"<<"
    return str(part)

def name_format(first, middle,last):

    first = first.upper()
    middle = middle.upper()
    last = last.upper()
    part= first +"<"+ middle + "<" +last
    sub = 30 - len(part)
    final=""
    if sub > 0:
        final = part + "<"*sub
    return final

In [151]:
dob_id_format("12/19/2020","M", "3327544")

'2019125M1702150<B003327544M<<'

In [157]:
for index, row in data.iterrows():
    first_name =row[1]
    middle_name=row[2]
    last_name = row[3]
    id_num =row[4]
    dob = row[5]
    gender =row[6]
    print(row[index])
    name_section = name_format(first_name, middle_name,last_name)
    print(name_section)
    dob_id= dob_id_format(dob, gender,id_num)
    print(dob_id)

9311296M1702150<B0033098733M<<
9712313M1702150<B0028976539M<<
9912220M1702150<B0001712854M<<
7208318M1702150<B0003042624M<<
9701159M1702150<B0000864870M<<
9509168M1702150<B0008757593M<<